# Ejercicios Pandas DataFrames 03

Carga el dataset del titanic

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
# !pip install tabulate
# https://pypi.org/project/tabulate/
from tabulate import tabulate

In [4]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/ricardoahumada/DataScienceBasics/refs/heads/main/data/titanic.csv')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  Unnamed: 15  0 non-null      float64
dtypes: bool(2), float64(3), int64(4), object(7)
memory usage: 99.3+ KB

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Unnamed: 15
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,NaN
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,NaN
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,NaN
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,NaN
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  Unnamed: 15  0 non-null      float64
dtypes: bool(2), float64(3), int64(4), object(7)
memory usage: 99.3+ KB

1. Escribe un programa Pandas para dividir los pasajeros en cuatro categorías según su edad.
Nota: Categorías de edad (0, 10), (10, 30), (30, 60), (60, 80)

In [6]:
""" df['cage'] =  """
cages = pd.cut(df['age'], [0,  10,  30, 60, 80])
print(cages)
df['cage'] = cages
# df.pop('Unnamed: 15')
df.head()
# df

0      (10.0, 30.0]
1      (30.0, 60.0]
2      (10.0, 30.0]
3      (30.0, 60.0]
4      (30.0, 60.0]
           ...
886    (10.0, 30.0]
887    (10.0, 30.0]
888             NaN
889    (10.0, 30.0]
890    (30.0, 60.0]
Name: age, Length: 891, dtype: category
Categories (4, interval[int64, right]): [(0, 10] < (10, 30] < (30, 60] < (60, 80]]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Unnamed: 15,cage
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,NaN,"(10, 30]"
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,NaN,"(30, 60]"
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,NaN,"(10, 30]"
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,NaN,"(30, 60]"
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,NaN,"(30, 60]"

2. Escribe un programa Pandas para crear una tabla dinámica y contar la supervivencia por género, categorías y edad de varias clases.
Nota: Categorías de edad (0, 10), (10, 30), (30, 60), (60, 80)

2.1. Usando pivot

In [7]:
pcdf = df.pivot(columns='class', values='survived')
print(pcdf)
ndf = pd.concat([df, pcdf], axis=1)
ndf

class  First  Second  Third
0        NaN     NaN    0.0
1        1.0     NaN    NaN
2        NaN     NaN    1.0
3        1.0     NaN    NaN
4        NaN     NaN    0.0
..       ...     ...    ...
886      NaN     0.0    NaN
887      1.0     NaN    NaN
888      NaN     NaN    0.0
889      1.0     NaN    NaN
890      NaN     NaN    0.0

[891 rows x 3 columns]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Unnamed: 15,cage,First,Second,Third
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,NaN,"(10.0, 30.0]",NaN,NaN,0.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,NaN,"(30.0, 60.0]",1.0,NaN,NaN
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,NaN,"(10.0, 30.0]",NaN,NaN,1.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,NaN,"(30.0, 60.0]",1.0,NaN,NaN
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,NaN,"(30.0, 60.0]",NaN,NaN,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,NaN,"(10.0, 30.0]",NaN,0.0,NaN
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,NaN,"(10.0, 30.0]",1.0,NaN,NaN
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN,NaN,NaN,NaN,0.0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,NaN,"(10.0, 30.0]",1.0,NaN,NaN
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,NaN,"(30.0, 60.0]",NaN,NaN,0.0

In [8]:
ndf.groupby(['sex', 'cage']).agg({'First': 'count', 'Second': 'count', 'Third': 'count'})

                 First  Second  Third
sex    cage
female (0, 10]       1       8     22
       (10, 30]     34      36     57
       (30, 60]     48      30     22
       (60, 80]      2       0      1
male   (0, 10]       2       9     22
       (10, 30]     24      43    151
       (30, 60]     63      44     76
       (60, 80]     12       3      4

2.1. Usando pivot_table

In [9]:
cage = pd.cut(df['age'], [0, 10, 30, 60, 80])
# print(cage)

result = df.pivot_table('survived', index=['sex',cage], columns='class', aggfunc='count')
result
# print(tabulate(result, headers='keys', tablefmt='psql'))

class            First  Second  Third
sex    age
female (0, 10]       1       8     22
       (10, 30]     34      36     57
       (30, 60]     48      30     22
       (60, 80]      2       0      1
male   (0, 10]       2       9     22
       (10, 30]     24      43    151
       (30, 60]     63      44     76
       (60, 80]     12       3      4

3. Escribe un programa Pandas para crear una tabla dinámica y encontrar la tasa de supervivencia por género y edad de las diferentes categorías de varias clases. 
Agregar la tarifa como una dimensión de columnas y divida la columna de tarifa en 2 categorías según los valores presentes en las columnas de tarifa.

In [10]:
fare = pd.qcut(df['fare'], 2)
age = pd.cut(df['age'], [0, 10, 30, 60, 80])
result = df.pivot_table('survived', index=['sex', age], columns=[fare, 'pclass'])
print(tabulate(result, headers='keys', tablefmt='psql'))

+----------------------------------------------+-------------------------------------------------+-------------------------------------------------+-------------------------------------------------+--------------------------------------------------+--------------------------------------------------+--------------------------------------------------+
|                                              |   (Interval(-0.001, 14.454, closed='right'), 1) |   (Interval(-0.001, 14.454, closed='right'), 2) |   (Interval(-0.001, 14.454, closed='right'), 3) |   (Interval(14.454, 512.329, closed='right'), 1) |   (Interval(14.454, 512.329, closed='right'), 2) |   (Interval(14.454, 512.329, closed='right'), 3) |
|----------------------------------------------+-------------------------------------------------+-------------------------------------------------+-------------------------------------------------+--------------------------------------------------+--------------------------------------------------+--------------------------------------------------|
| ('female', Interval(0, 10, closed='right'))  |                                             nan |                                     nan         |                                        0.8      |                                        0         |                                         1        |                                         0.411765 |
| ('female', Interval(10, 30, closed='right')) |                                             nan |                                       0.933333  |                                        0.568182 |                                        0.970588  |                                         0.904762 |                                         0.307692 |
| ('female', Interval(30, 60, closed='right')) |                                             nan |                                       0.846154  |                                        0.142857 |                                        0.979167  |                                         0.941176 |                                         0.333333 |
| ('female', Interval(60, 80, closed='right')) |                                             nan |                                     nan         |                                        1        |                                        1         |                                       nan        |                                       nan        |
| ('male', Interval(0, 10, closed='right'))    |                                             nan |                                     nan         |                                        1        |                                        1         |                                         1        |                                         0.263158 |
| ('male', Interval(10, 30, closed='right'))   |                                             nan |                                       0.0344828 |                                        0.140625 |                                        0.458333  |                                         0        |                                         0.130435 |
| ('male', Interval(30, 60, closed='right'))   |                                               0 |                                       0.130435  |                                        0.109375 |                                        0.440678  |                                         0.047619 |                                         0.166667 |
| ('male', Interval(60, 80, closed='right'))   |                                             nan |                                       0.333333  |                                        0        |                                        0.0833333 |                                       nan        |                                       nan        |
+----------------------------------------------+-------------------------------------------------+-------------------------------------------------+-------------------------------------------------+--------------------------------------------------+--------------------------------------------------+--------------------------------------------------+

4. Escribe un programa Pandas para crear una tabla dinámica y calcular la cantidad de mujeres y hombres que había en una clase de cabina en particular.

In [11]:
result = df.pivot_table(index=['sex'], columns=['pclass'], aggfunc='count')
print(result)
print(tabulate(result, headers='keys', tablefmt='psql'))

       Unnamed: 15       adult_male            age          alive  ... parch  \
pclass           1  2  3          1    2    3    1   2    3     1  ...     3
sex                                                                ...
female           0  0  0         94   76  144   85  74  102    94  ...   144
male             0  0  0        122  108  347  101  99  253   122  ...   347

       sibsp           survived            who
pclass     1    2    3        1    2    3    1    2    3
sex
female    94   76  144       94   76  144   94   76  144
male     122  108  347      122  108  347  122  108  347

[2 rows x 45 columns]
+--------+----------------------+----------------------+----------------------+---------------------+---------------------+---------------------+--------------+--------------+--------------+----------------+----------------+----------------+----------------+----------------+----------------+---------------+---------------+---------------+----------------+----------------+----------------+---------------+---------------+---------------+----------------------+----------------------+----------------------+-------------------+-------------------+-------------------+---------------+---------------+---------------+----------------+----------------+----------------+----------------+----------------+----------------+-------------------+-------------------+-------------------+--------------+--------------+--------------+
| sex    |   ('Unnamed: 15', 1) |   ('Unnamed: 15', 2) |   ('Unnamed: 15', 3) |   ('adult_male', 1) |   ('adult_male', 2) |   ('adult_male', 3) |   ('age', 1) |   ('age', 2) |   ('age', 3) |   ('alive', 1) |   ('alive', 2) |   ('alive', 3) |   ('alone', 1) |   ('alone', 2) |   ('alone', 3) |   ('cage', 1) |   ('cage', 2) |   ('cage', 3) |   ('class', 1) |   ('class', 2) |   ('class', 3) |   ('deck', 1) |   ('deck', 2) |   ('deck', 3) |   ('embark_town', 1) |   ('embark_town', 2) |   ('embark_town', 3) |   ('embarked', 1) |   ('embarked', 2) |   ('embarked', 3) |   ('fare', 1) |   ('fare', 2) |   ('fare', 3) |   ('parch', 1) |   ('parch', 2) |   ('parch', 3) |   ('sibsp', 1) |   ('sibsp', 2) |   ('sibsp', 3) |   ('survived', 1) |   ('survived', 2) |   ('survived', 3) |   ('who', 1) |   ('who', 2) |   ('who', 3) |
|--------+----------------------+----------------------+----------------------+---------------------+---------------------+---------------------+--------------+--------------+--------------+----------------+----------------+----------------+----------------+----------------+----------------+---------------+---------------+---------------+----------------+----------------+----------------+---------------+---------------+---------------+----------------------+----------------------+----------------------+-------------------+-------------------+-------------------+---------------+---------------+---------------+----------------+----------------+----------------+----------------+----------------+----------------+-------------------+-------------------+-------------------+--------------+--------------+--------------|
| female |                    0 |                    0 |                    0 |                  94 |                  76 |                 144 |           85 |           74 |          102 |             94 |             76 |            144 |             94 |             76 |            144 |            85 |            74 |           102 |             94 |             76 |            144 |            81 |            10 |             6 |                   92 |                   76 |                  144 |                92 |                76 |               144 |            94 |            76 |           144 |             94 |             76 |            144 |             94 |             76 |            144 |                94 |                76 |               144 |           94 |           76 |          144 |
| male   |                    0 |                    0 |                    0 |                 122 |                 108 |                 347 |          101 |           99 |          253 |            122 |            108 |            347 |            122 |            108 |            347 |           101 |            99 |           253 |            122 |            108 |            347 |            94 |             6 |             6 |                  122 |                  108 |                  347 |               122 |               108 |               347 |           122 |           108 |           347 |            122 |            108 |            347 |            122 |            108 |            347 |               122 |               108 |               347 |          122 |          108 |          347 |
+--------+----------------------+----------------------+----------------------+---------------------+---------------------+---------------------+--------------+--------------+--------------+----------------+----------------+----------------+----------------+----------------+----------------+---------------+---------------+---------------+----------------+----------------+----------------+---------------+---------------+---------------+----------------------+----------------------+----------------------+-------------------+-------------------+-------------------+---------------+---------------+---------------+----------------+----------------+----------------+----------------+----------------+----------------+-------------------+-------------------+-------------------+--------------+--------------+--------------+

5. Escribe un programa Pandas para crear una tabla dinámica y separar el género según si viajaron solos o no para obtener la probabilidad de supervivencia.

In [12]:
result = df.pivot_table( 'survived' , [ 'sex' , 'alone' ] , 'class' )
print(tabulate(result, headers='keys', tablefmt='psql'))

+-------------------+----------+-----------+----------+
|                   |    First |    Second |    Third |
|-------------------+----------+-----------+----------|
| ('female', False) | 0.966667 | 0.931818  | 0.416667 |
| ('female', True)  | 0.970588 | 0.90625   | 0.616667 |
| ('male', False)   | 0.425532 | 0.277778  | 0.180723 |
| ('male', True)    | 0.333333 | 0.0972222 | 0.121212 |
+-------------------+----------+-----------+----------+

6. Escribe un programa Pandas para crear una tabla dinámica y encontrar la probabilidad de supervivencia por clase, género, embarque en solitario y puerto de embarque.

In [13]:
result = df.pivot_table('survived', ['sex' , 'alone' ], [ 'embark_town', 'class' ])
print(tabulate(result, headers='keys', tablefmt='psql'))

+-------------------+--------------------------+---------------------------+--------------------------+---------------------------+----------------------------+---------------------------+----------------------------+-----------------------------+----------------------------+
|                   |   ('Cherbourg', 'First') |   ('Cherbourg', 'Second') |   ('Cherbourg', 'Third') |   ('Queenstown', 'First') |   ('Queenstown', 'Second') |   ('Queenstown', 'Third') |   ('Southampton', 'First') |   ('Southampton', 'Second') |   ('Southampton', 'Third') |
|-------------------+--------------------------+---------------------------+--------------------------+---------------------------+----------------------------+---------------------------+----------------------------+-----------------------------+----------------------------|
| ('female', False) |                 1        |                  1        |                 0.611111 |                         1 |                        nan |                 0.625     |                   0.941176 |                   0.923077  |                   0.327586 |
| ('female', True)  |                 0.944444 |                  1        |                 0.8      |                       nan |                          1 |                 0.76      |                   1        |                   0.892857  |                   0.466667 |
| ('male', False)   |                 0.473684 |                  0.166667 |                 0.5      |                         0 |                        nan |                 0.1       |                   0.407407 |                   0.3       |                   0.142857 |
| ('male', True)    |                 0.347826 |                  0.25     |                 0.151515 |                       nan |                          0 |                 0.0689655 |                   0.326923 |                   0.0895522 |                   0.123762 |
+-------------------+--------------------------+---------------------------+--------------------------+---------------------------+----------------------------+---------------------------+----------------------------+-----------------------------+----------------------------+